interface User {
    age: number;
    name: string;
}

// 변수에 인터페이스 활용
var seho: User = {
    age: 33,
    name: '세호',
}


// 함수에 인터페이스 활용
function getUser(user: User): void {
    console.log(user)

}
const capt = {
    age: 100,
    name: '캡틴',
}
getUser(capt);


/* **************************************************************************************
*****************************************************************************************
************************************************************************************** */

// 함수의 스펙(구조)에 인터페이스를 활용
interface SumFunction{
    (a: number, b: number): number;     // 매개변수 기본정의
}

var sum: SumFunction;
sum = function(a: number, b: number){
    return a+b;
}

/* **************************************************************************************
*****************************************************************************************
************************************************************************************** */
// 인터페이스 인덱싱
interface StringArray {
    [index: number]: string;
}

var arr: StringArray = ['a', 'b', 'c']
arr[0] = '10';


/* **************************************************************************************
*****************************************************************************************
************************************************************************************** */
// 디ㄱ셔너리 패턴
interface StringRegexDictionary{        // 정규식 키벨류
    [key: string]: RegExp
}

var obj: StringRegexDictionary = {
    // sth: /abc/,
    cssFile: /\.css$/,
    jsFile: /\.js$/,
}

Object.keys(obj).forEach(function(value){

})

/* **************************************************************************************
*****************************************************************************************
************************************************************************************** */
// 인터페이스 확장
interface Person {
    name: string;
    age: number;
}

interface Devloper extends Person{  // 상속을 통해 확장
    language: string
}

var captain: Devloper = {
    language : 'hi',
    name: '캡틴',
    age: 100,
}